app/controllers/forecast_controller.rb

SELECT * FROM "forecasts"
---
  def view

    @date_format = "%a %d"
    @time_format = "%Hh"
    @f_offset = 3 #when are we going to start showing the forecasts?
    @max_per_row = 31 #how many per row


    float_regex =  /^-?[0-9]+\.?[0-9]*$/

    @lat = params[:lat]
    @lon = params[:lon]


    @fpoint = ForecastPoint.find_by_lat_and_lon(@lat,@lon)

    unless @fpoint
      render :nothing => true
      return
    end


    unless ( @lat =~ float_regex and  @lon =~ float_regex )
      #TODO: Error pages when the parameters are malformed
      render :nothing => true
    else
      @all = Forecast.find_all_by_lat_and_lon(@lat,@lon)
      if @all.size == 0