app/controllers/forecast_points_controller.rb

  def index
    @forecast_points = ForecastPoint.all
---
SELECT * FROM "forecast_points"

  def show
    @forecast_point = ForecastPoint.find(params[:id])
---
SELECT * FROM "forecast_points" WHERE ("forecast_points"."id" = 2053932785)

  def edit
    @forecast_point = ForecastPoint.find(params[:id])
---
SELECT * FROM "forecast_points" WHERE ("forecast_points"."id" = 2053932785)

  def create
    @forecast_point = ForecastPoint.new(params[:forecast_point])

    respond_to do |format|
      if @forecast_point.save
---
INSERT INTO "forecast_points" ("lon", "name", "throttle", "lat") VALUES(NULL, NULL, NULL, NULL)

  def update
    @forecast_point = ForecastPoint.find(params[:id])
---
SELECT * FROM "forecast_points" WHERE ("forecast_points"."id" = 2053932785)

  def destroy
    @forecast_point = ForecastPoint.find(params[:id])
    @forecast_point.destroy
---
SELECT * FROM "forecast_points" WHERE ("forecast_points"."id" = 2053932785)
DELETE FROM "forecast_points" WHERE "id" = 2053932785